## BASICS

### SELECTing single columns

In `SQL`, you can select data from a table using a `SELECT` statement. For example, the following query selects the name column from the people table:

>SELECT name<br>
FROM people;

In this query, `SELECT` and `FROM` are called keywords. In `SQL`, keywords are not case-sensitive, which means you can write the same query as:

>select name<br>
from people;

That said, it's good practice to make `SQL` keywords uppercase to distinguish them from other parts of your query, like column and table names.

It's also good practice to include a semicolon at the end of your query. This tells `SQL` where the end of your query is!

### SELECTing multiple columns

To select multiple columns from a table, simply separate the column names with commas!
<br>For example, this query selects two columns, `name` and `birthdate`, from the `people` table:

>SELECT name, birthdate
FROM people;

Sometimes, you may want to select all columns from a table. Typing out every column name would be a pain, so there's a handy shortcut:

>SELECT *
FROM people;

If you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:

>SELECT *
FROM people
LIMIT 10;

### DISTINCT Values

Often your results will include many duplicate values. If you want to select all the unique values from a column, you can use the `DISTINCT` keyword.

### Learning to COUNT

The `COUNT()` function lets you do this by returning the number of rows in one or more columns.<br>`COUNT(*)` tells you how many rows are in a table. However, if you want to count the number of non-missing values in a particular column, you can call `COUNT()` on just that column.

For example, to count the number of birth dates present in the people table:

>SELECT COUNT(birthdate)
FROM people;

It's also common to combine `COUNT()` with `DISTINCT` to count the number of distinct values in a column.
For example, this query counts the number of distinct birth dates contained in the people table:

>SELECT COUNT(DISTINCT birthdate)
FROM people;

## Filtering

In `SQL`, the `WHERE` keyword allows you to filter based on both text and numeric values in a table. There are a few different comparison operators you can use:

* = equal
* <> not equal
* < less than
* {}> greater than
* <= less than or equal to
* {}>= greater than or equal to<br>
**Ignore the {}**
<br>
For example, you can filter text records such as `title`. The following code returns all films with the `title` 'Metropolis':

>SELECT title<br>
FROM films<br>
WHERE title = 'Metropolis';

### Simple filtering of numeric values

The following query selects all details for films with a budget over ten thousand dollars:

>SELECT *<br>
FROM films<br>
WHERE budget > 10000;

### Simple filtering of text

The `WHERE` clause can also be used to filter text results, such as names or countries.

For example, this query gets the titles of all films which were filmed in China:

>SELECT title
FROM films
WHERE country = 'China';

### `WHERE` `AND`

Often, you'll want to select data based on multiple conditions. You can build up your `WHERE` queries by combining multiple conditions with the `AND` keyword.

For example,

>SELECT title<br>
FROM films<br>
WHERE release_year > 1994<br>
AND release_year < 2000;

gives you the titles of films released between 1994 and 2000.

Note that you need to specify the column name separately for every `AND` condition, so the following would be invalid:

>SELECT title<br>
FROM films<br>
WHERE release_year > 1994 AND < 2000;

### `WHERE` `AND` `OR`

In case you want to select rows based on multiple conditions where some but not all of the conditions need to be met you can use SQL's `OR` operator.

For example, the following returns all films released in either 1994 or 2000:

>SELECT title <br>
FROM films<br>
WHERE release_year = 1994<br>
OR release_year = 2000;

Note that just like `AND` you need to specify the column for every `OR` condition

When combining `AND` and `OR`, be sure to enclose the individual clauses in parentheses, like so:

>SELECT title <br>
FROM films<br>
WHERE (release_year = 1994 OR release_year = 1995)<br>
AND (certification = 'PG' OR certification = 'R');

Otherwise, due to SQL's precedence rules, you may not get the results you're expecting!

### `BETWEEN`

In SQL the `BETWEEN` keyword provides a useful shorthand for filtering values within a specified range.

>SELECT title<br>
FROM films<br>
WHERE release_year<br>
BETWEEN 1994 AND 2000;

The above query is the same as
>SELECT title<br>
FROM films<br>
WHERE release_year >= 1994<br>
AND release_year <= 2000;

**It's important to remember that BETWEEN is inclusive, meaning the beginning and end values are included in the results!**

Similar to the `WHERE` clause, the `BETWEEN` clause can be used with multiple `AND` and `OR` operators. For example, suppose we have a table called kids. We can get the names of all kids between the ages of 2 and 12 from the United States:

>SELECT name<br>
FROM kids<br>
WHERE age BETWEEN 2 AND 12<br>
AND nationality = 'USA';

### `IN BETWEEN`

The `IN` operator allows you to specify multiple values in a `WHERE` clause, making it easier and quicker to specify multiple `OR` conditions.

>SELECT name<br>
FROM kids<br>
WHERE age IN (2, 4, 6, 8, 10);

### Introduction to `NULL` and `IS NULL`

In SQL, `NULL` represents a missing or unknown value. You can check for `NULL` values using the expression `IS NULL`. For example, to count the number of missing birth dates in the `people` table:

>SELECT COUNT(*)<br>
FROM people<br>
WHERE birthdate IS NULL;

Sometimes, you'll want to filter out missing values so you only get results which are not NULL. To do this, you can use the `IS NOT NULL` operator.
>SELECT COUNT(*)<br>
FROM people<br>
WHERE birthdate IS NOT NULL;

### `LIKE` and `NOT LIKE`

In `SQL`, the `LIKE` operator can be used in a `WHERE` clause to search for a pattern in a column. To accomplish this, you use something called a wildcard as a placeholder for some other values. There are two wildcards you can use with `LIKE`:

The `%` wildcard will match zero, one, or many characters in text. For example, the following query matches companies like `'Data'`, `'DataC'` `'DataCamp'`, `'DataMind'`, and so on:
>SELECT name<br>
FROM companies<br>
WHERE name LIKE 'Data%';

The `_` wildcard will match a single character. For example, the following query matches companies like `'DataCamp'`, `'DataComp'`, and so on:
>SELECT name <br>
FROM companies<br>
WHERE name LIKE 'DataC_mp';

You can also use the `NOT LIKE `operator to find records that don't match the pattern you specify.

## Aggregate functions and Aliasing

Often, you will want to perform some calculation on the data in a database. `SQL` provides a few functions, called *aggregate functions*, to help you out with this.

For example,
>SELECT AVG(budget) <br>
FROM films;<br>

gives you the average value from the budget column of the films table. Similarly, the `MAX()` function returns the highest budget:

>SELECT MAX(budget) <br>
FROM films;

And more

### Combining aggregate functions with `WHERE`

Aggregate functions can be combined with the `WHERE` clause to gain further insights from your data.

For example, to get the total budget of movies made in the year 2010 or later:

>SELECT SUM(budget)<br>
FROM films<br>
WHERE release_year >= 2010;

**A note on arithmetic**

>A note on arithmetic
In addition to using aggregate functions, you can perform basic arithmetic with symbols like +, -, *, and /. So, for example, this gives a result of 12: <br>SELECT (4 * 3);<br>
However, the following gives a result of 1:<br>SELECT (4 / 3);<br> SQL assumes that if you divide an integer by an integer, you want to get an integer back. So be careful when dividing!<br>If you want more precision when dividing, you can add decimal places to your numbers. For example,<br>SELECT (4.0 / 3.0)<br> AS result;
gives you the result you would expect: 1.333.

### AS aliasing

Suppose you want to get something like this:
>SELECT MAX(budget), MAX(duration)<br>
FROM films;

Well, then you'd have two columns named max, which isn't very useful!
To avoid situations like this, `SQL` allows you to do something called aliasing. Aliasing simply means you assign a temporary name to something. To alias, you use the `AS` keyword.
>SELECT MAX(budget) AS max_budget,<br>
       MAX(duration) AS max_duration<br>
FROM films;

## `ORDER BY` and `GROUP BY`

In `SQL`, the `ORDER BY` keyword is used to sort results in ascending or descending order according to the values of one or more columns.<br>
By default `ORDER BY` will sort in ascending order. If you want to sort the results in descending order, you can use the `DESC` keyword. For example,

>SELECT title<br>
FROM films<br>
ORDER BY release_year DESC;

gives you the titles of films sorted by release year, from newest to oldest.

### Sorting multiple columns

`ORDER BY` can also be used to sort on multiple columns. It will sort by the first column specified, then sort by the next, then the next, and so on. For example,

>SELECT birthdate, name <br>
FROM people<br>
ORDER BY birthdate, name;<br>

sorts on birth dates first (oldest to newest) and then sorts on the names in alphabetical order. The order of columns is important!

### `GROUP BY`

For example, you might want to count the number of male and female employees in your company. Here, what you want is to group all the males together and count them, and group all the females together and count them. In `SQL`, `GROUP BY` allows you to group a result by one or more columns, like so:

>SELECT sex, count(*)<br>
FROM employees<br>
GROUP BY sex;

Commonly, `GROUP BY` is used with aggregate functions like `COUNT()` or `MAX()`. Note that `GROUP BY` always goes after the `FROM` clause!

Note that you can combine `GROUP BY` with `ORDER BY` to group your results, calculate something about them, and then order your results. For example,

>SELECT sex, count(*)<br>
FROM employees<br>
GROUP BY sex<br>
ORDER BY count DESC;

Note also that `ORDER BY` always goes after `GROUP BY`.

### `HAVING`

In `SQL`, aggregate functions can't be used in `WHERE` clauses. For example, the following query is **invalid**:

>SELECT release_year<br>
FROM films<br>
GROUP BY release_year<br>
WHERE COUNT(title) > 10;

This means that if you want to filter based on the result of an aggregate function, you need another way! That's where the `HAVING` clause comes in. For example,

>SELECT release_year<br>
FROM films<br>
GROUP BY release_year<br>
HAVING COUNT(title) > 10;

shows only those years in which more than 10 films were released.